/** Формат записи МСК */
export interface MskRecord {
    /** ID МСК */
    id: string
    /** Наименование МСК */
    name: string
    /** Регион использования МСК */
    region: string,
    /** Проекция МСК для proj4 */
    proj: string
}

let msk: MskRecord[] = [
    {
        "id": "MSK01z1",
        "name": "МСК-01, Зона 1",
        "region": "Республика Адыгея",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=37.98333333333 +k=1 +x_0=1300000 +y_0=-4511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK01z2",
        "name": "МСК-01, Зона 2",
        "region": "Республика Адыгея",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=40.98333333333 +k=1 +x_0=2300000 +y_0=-4511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK02z1",
        "name": "МСК-02, Зона 1",
        "region": "Республика Башкортостан",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=55.03333333333 +k=1 +x_0=1300000 +y_0=-5409414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK02z2",
        "name": "МСК-02, Зона 2",
        "region": "Республика Башкортостан",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=58.03333333333 +k=1 +x_0=2300000 +y_0=-5409414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK03z1",
        "name": "МСК-03, Зона 1",
        "region": "Республика Бурятия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=100.03333333333 +k=1 +x_0=1250000 +y_0=-5211057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK03z2",
        "name": "МСК-03, Зона 2",
        "region": "Республика Бурятия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=103.03333333333 +k=1 +x_0=2250000 +y_0=-5211057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK03z3",
        "name": "МСК-03, Зона 3",
        "region": "Республика Бурятия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=106.03333333333 +k=1 +x_0=3250000 +y_0=-5211057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK03z4",
        "name": "МСК-03, Зона 4",
        "region": "Республика Бурятия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=109.03333333333 +k=1 +x_0=4250000 +y_0=-5211057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK03z5",
        "name": "МСК-03, Зона 5",
        "region": "Республика Бурятия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=112.03333333333 +k=1 +x_0=5250000 +y_0=-5211057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK03z6",
        "name": "МСК-03, Зона 6",
        "region": "Республика Бурятия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=115.03333333333 +k=1 +x_0=6250000 +y_0=-5211057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK03z7",
        "name": "МСК-03, Зона 7",
        "region": "Республика Бурятия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=118.03333333333 +k=1 +x_0=7250000 +y_0=-5211057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK04z1",
        "name": "МСК-04, Зона 1",
        "region": "Республика Алтай",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=85.46666666666 +k=1 +x_0=1300000 +y_0=-5112900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK04z2",
        "name": "МСК-04, Зона 2",
        "region": "Республика Алтай",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=88.46666666666 +k=1 +x_0=2300000 +y_0=-5112900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK05",
        "name": "МСК-05",
        "region": "Республика Дагестан",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=46.98333333333 +k=1 +x_0=4300000 +y_0=-11057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK06",
        "name": "МСК-06",
        "region": "Республика Ингушетия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.98333333333 +k=1 +x_0=1300000 +y_0=-4311057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK07",
        "name": "МСК-07",
        "region": "Кабардино-Балкарская Республика",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.98333333333 +k=1 +x_0=1300000 +y_0=-4311057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK08z1",
        "name": "МСК-08, Зона 1",
        "region": "Республика Калмыкия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=40.98333333333 +k=1 +x_0=1300000 +y_0=-4711057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK08z2",
        "name": "МСК-08, Зона 2",
        "region": "Республика Калмыкия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.98333333333 +k=1 +x_0=2300000 +y_0=-4711057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK08z3",
        "name": "МСК-08, Зона 3",
        "region": "Республика Калмыкия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=46.98333333333 +k=1 +x_0=3300000 +y_0=-4711057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK09",
        "name": "МСК-09",
        "region": "Республика Карачаево-Черкесия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=40.98333333333 +k=1 +x_0=1300000 +y_0=-4311057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK10d6z1",
        "name": "МСК-10 (6°), Зона 1",
        "region": "Республика Карелия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=32.03333333333 +k=1 +x_0=1400000 +y_0=-6511057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK10d6z2",
        "name": "МСК-10 (6°), Зона 2",
        "region": "Республика Карелия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.03333333333 +k=1 +x_0=2400000 +y_0=-6511057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK11z1",
        "name": "МСК-11, Зона 1",
        "region": "Республика Коми",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.03333333333 +k=1 +x_0=1400000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK11z2",
        "name": "МСК-11, Зона 2",
        "region": "Республика Коми",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.03333333333 +k=1 +x_0=2400000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK11z3",
        "name": "МСК-11, Зона 3",
        "region": "Республика Коми",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=47.03333333333 +k=1 +x_0=3400000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK11z4",
        "name": "МСК-11, Зона 4",
        "region": "Республика Коми",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=50.03333333333 +k=1 +x_0=4400000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK11z5",
        "name": "МСК-11, Зона 5",
        "region": "Республика Коми",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=53.03333333333 +k=1 +x_0=5400000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK11z6",
        "name": "МСК-11, Зона 6",
        "region": "Республика Коми",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=56.03333333333 +k=1 +x_0=6400000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK11z7",
        "name": "МСК-11, Зона 7",
        "region": "Республика Коми",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=59.03333333333 +k=1 +x_0=7400000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK11z8",
        "name": "МСК-11, Зона 8",
        "region": "Республика Коми",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=62.03333333333 +k=1 +x_0=8400000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK11z9",
        "name": "МСК-11, Зона 9",
        "region": "Республика Коми",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=65.03333333333 +k=1 +x_0=9400000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK12z1",
        "name": "МСК-12, Зона 1",
        "region": "Республика Марий Эл",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=47.55 +k=1 +x_0=1250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK12z2",
        "name": "МСК-12, Зона 2",
        "region": "Республика Марий Эл",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=50.55 +k=1 +x_0=2250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK13z1",
        "name": "МСК-13, Зона 1",
        "region": "Республика Мордовия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.55 +k=1 +x_0=1250000 +y_0=-5614743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK13z2",
        "name": "МСК-13, Зона 2",
        "region": "Республика Мордовия",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=47.55 +k=1 +x_0=2250000 +y_0=-5614743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK14d6z1",
        "name": "МСК-14 (6°), Зона 1",
        "region": "Республика Саха (Якутия)",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=108.45 +k=1 +x_0=1400000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK14d6z2",
        "name": "МСК-14 (6°), Зона 2",
        "region": "Республика Саха (Якутия)",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=114.45 +k=1 +x_0=2400000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK14d6z3",
        "name": "МСК-14 (6°), Зона 3",
        "region": "Республика Саха (Якутия)",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=120.45 +k=1 +x_0=3400000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK14d6z4",
        "name": "МСК-14 (6°), Зона 4",
        "region": "Республика Саха (Якутия)",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=126.45 +k=1 +x_0=4400000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK14d6z5",
        "name": "МСК-14 (6°), Зона 5",
        "region": "Республика Саха (Якутия)",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=132.45 +k=1 +x_0=5400000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK14d6z6",
        "name": "МСК-14 (6°), Зона 6",
        "region": "Республика Саха (Якутия)",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=138.45 +k=1 +x_0=6400000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK14d6z7",
        "name": "МСК-14 (6°), Зона 7",
        "region": "Республика Саха (Якутия)",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=144.45 +k=1 +x_0=7400000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK14d6z8",
        "name": "МСК-14 (6°), Зона 8",
        "region": "Республика Саха (Якутия)",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=150.45 +k=1 +x_0=8400000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK14d6z9",
        "name": "МСК-14 (6°), Зона 9",
        "region": "Республика Саха (Якутия)",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=156.45 +k=1 +x_0=9400000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK15",
        "name": "МСК-15",
        "region": "Северная Осетия — Алания",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.98333333333 +k=1 +x_0=1300000 +y_0=-4311057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK16z1",
        "name": "МСК-16, Зона 1",
        "region": "Республика Татарстан",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=49.033333333333 +k=1 +x_0=1300000 +y_0=-5709414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK16z2",
        "name": "МСК-16, Зона 2",
        "region": "Республика Татарстан",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=52.033333333333 +k=1 +x_0=2300000 +y_0=-5709414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK16z3",
        "name": "МСК-16, Зона 3",
        "region": "Республика Татарстан",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=55.033333333333 +k=1 +x_0=3300000 +y_0=-5709414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK18z1",
        "name": "МСК-18, Зона 1",
        "region": "Удмуртская Республика",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=50.55 +k=1 +x_0=1250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK18z2",
        "name": "МСК-18, Зона 2",
        "region": "Удмуртская Республика",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=53.55 +k=1 +x_0=2250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK20z1",
        "name": "МСК-20, Зона 1",
        "region": "Чеченская Республика",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.98333333333 +k=1 +x_0=1300000 +y_0=-4311057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK20z2",
        "name": "МСК-20, Зона 2",
        "region": "Чеченская Республика",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=46.98333333333 +k=1 +x_0=2300000 +y_0=-4311057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK21z1",
        "name": "МСК-21, Зона 1",
        "region": "Чувашская Республика",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=47.55 +k=1 +x_0=1250000 +y_0=-5814743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK21z2",
        "name": "МСК-21, Зона 2",
        "region": "Чувашская Республика",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=50.55 +k=1 +x_0=2250000 +y_0=-5814743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK22z1",
        "name": "МСК-22, Зона 1",
        "region": "Алтайский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=79.46666666666 +k=1 +x_0=1300000 +y_0=-5312900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK22z2",
        "name": "МСК-22, Зона 2",
        "region": "Алтайский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=82.46666666666 +k=1 +x_0=2300000 +y_0=-5312900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK22z3",
        "name": "МСК-22, Зона 3",
        "region": "Алтайский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=85.46666666666 +k=1 +x_0=3300000 +y_0=-5312900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK23z1",
        "name": "МСК-23, Зона 1",
        "region": "Краснодарский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=37.98333333333 +k=1 +x_0=1300000 +y_0=-4511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK23z2",
        "name": "МСК-23, Зона 2",
        "region": "Краснодарский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=40.98333333333 +k=1 +x_0=2300000 +y_0=-4511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK24d6z1",
        "name": "МСК-24 (6°), Зона 1",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=81.51666666666 +k=1 +x_0=1500000 +y_0=-5416586.442 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK24d6z2",
        "name": "МСК-24 (6°), Зона 2",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=87.51666666666 +k=1 +x_0=2500000 +y_0=-5416586.442 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK24d6z3",
        "name": "МСК-24 (6°), Зона 3",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=93.51666666666 +k=1 +x_0=3500000 +y_0=-5416586.442 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK24d6z4",
        "name": "МСК-24 (6°), Зона 4",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=99.51666666666 +k=1 +x_0=4500000 +y_0=-5416586.442 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK24d6z5",
        "name": "МСК-24 (6°), Зона 5",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=105.51666666666 +k=1 +x_0=5500000 +y_0=-5416586.442 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK24d6z6",
        "name": "МСК-24 (6°), Зона 6",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=111.51666666666 +k=1 +x_0=6500000 +y_0=-5416586.442 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK25z1",
        "name": "МСК-25, Зона 1",
        "region": "Приморский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=130.71666666666 +k=1 +x_0=1300000 +y_0=-4416586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK25z2",
        "name": "МСК-25, Зона 2",
        "region": "Приморский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=133.71666666666 +k=1 +x_0=2300000 +y_0=-4416586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK25z3",
        "name": "МСК-25, Зона 3",
        "region": "Приморский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=136.71666666666 +k=1 +x_0=3300000 +y_0=-4416586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK25z4",
        "name": "МСК-25, Зона 4",
        "region": "Приморский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=139.71666666666 +k=1 +x_0=4300000 +y_0=-4416586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK26z1",
        "name": "МСК-26, Зона 1",
        "region": "Ставропольский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=40.98333333333 +k=1 +x_0=1300000 +y_0=-4511057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK26z2",
        "name": "МСК-26, Зона 2",
        "region": "Ставропольский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.98333333333 +k=1 +x_0=2300000 +y_0=-4511057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK27z1",
        "name": "МСК-27, Зона 1",
        "region": "Хабаровский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=130.71666666666 +k=1 +x_0=1300000 +y_0=-4916586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK27z2",
        "name": "МСК-27, Зона 2",
        "region": "Хабаровский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=133.71666666666 +k=1 +x_0=2300000 +y_0=-4916586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK27z3",
        "name": "МСК-27, Зона 3",
        "region": "Хабаровский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=136.71666666666 +k=1 +x_0=3300000 +y_0=-4916586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK27z4",
        "name": "МСК-27, Зона 4",
        "region": "Хабаровский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=139.71666666666 +k=1 +x_0=4300000 +y_0=-4916586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK27z5",
        "name": "МСК-27, Зона 5",
        "region": "Хабаровский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=142.71666666666 +k=1 +x_0=5300000 +y_0=-4916586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK27z6",
        "name": "МСК-27, Зона 6",
        "region": "Хабаровский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=145.71666666666 +k=1 +x_0=6300000 +y_0=-4916586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK28z1",
        "name": "МСК-28, Зона 1",
        "region": "Амурская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=121.71666666666 +k=1 +x_0=1300000 +y_0=-5116586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK28z2",
        "name": "МСК-28, Зона 2",
        "region": "Амурская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=124.71666666666 +k=1 +x_0=2300000 +y_0=-5116586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK28z3",
        "name": "МСК-28, Зона 3",
        "region": "Амурская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=127.71666666666 +k=1 +x_0=3300000 +y_0=-5116586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK28z4",
        "name": "МСК-28, Зона 4",
        "region": "Амурская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=130.71666666666 +k=1 +x_0=4300000 +y_0=-5116586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK28z5",
        "name": "МСК-28, Зона 5",
        "region": "Амурская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=133.71666666666 +k=1 +x_0=5300000 +y_0=-5116586.44 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK29d6z1",
        "name": "МСК-29 (6°), Зона 1",
        "region": "Архангельская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=32.03333333333 +k=1 +x_0=1400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK29d6z2",
        "name": "МСК-29 (6°), Зона 2",
        "region": "Архангельская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.03333333333 +k=1 +x_0=2400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK29d6z3",
        "name": "МСК-29 (6°), Зона 3",
        "region": "Архангельская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.03333333333 +k=1 +x_0=3400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK29d6z4",
        "name": "МСК-29 (6°), Зона 4",
        "region": "Архангельская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=50.03333333333 +k=1 +x_0=4400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK29d6z5",
        "name": "МСК-29 (6°), Зона 5",
        "region": "Архангельская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=56.03333333333 +k=1 +x_0=5400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK30z1",
        "name": "МСК-30, Зона 1",
        "region": "Астраханская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=46.05 +k=1 +x_0=1300000 +y_0=-4714743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK30z2",
        "name": "МСК-30, Зона 2",
        "region": "Астраханская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=49.05 +k=1 +x_0=2300000 +y_0=-4714743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK31z1",
        "name": "МСК-31, Зона 1",
        "region": "Белгородская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=1250000 +y_0=-5212900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK31z2",
        "name": "МСК-31, Зона 2",
        "region": "Белгородская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=2250000 +y_0=-5212900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK32z1",
        "name": "МСК-32, Зона 1",
        "region": "Брянская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=32.48333333333 +k=1 +x_0=1250000 +y_0=-5412900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK32z2",
        "name": "МСК-32, Зона 2",
        "region": "Брянская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=2250000 +y_0=-5412900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK33s63z1",
        "name": "МСК-33 (от СК-63), Зона 1",
        "region": "Владимирская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.55 +k=1 +x_0=1250000 +y_0=-5814743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK33s63z2",
        "name": "МСК-33 (от СК-63), Зона 2",
        "region": "Владимирская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.55 +k=1 +x_0=2250000 +y_0=-5814743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK33s63z3",
        "name": "МСК-33 (от СК-63), Зона 3",
        "region": "Владимирская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.55 +k=1 +x_0=3250000 +y_0=-5814743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK33s95",
        "name": "МСК-33 (от СК-95)",
        "region": "Владимирская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=39 +k=1 +x_0=134156.988 +y_0=-6032524.376 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK34z1",
        "name": "МСК-34, Зона 1",
        "region": "Волгоградская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.05 +k=1 +x_0=1300000 +y_0=-4914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK34z2",
        "name": "МСК-34, Зона 2",
        "region": "Волгоградская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=46.05 +k=1 +x_0=2300000 +y_0=-4914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK35z1",
        "name": "МСК-35, Зона 1",
        "region": "Вологодская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.55 +k=1 +x_0=1250000 +y_0=-6214743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK35z2",
        "name": "МСК-35, Зона 2",
        "region": "Вологодская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.55 +k=1 +x_0=2250000 +y_0=-6214743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK35z3",
        "name": "МСК-35, Зона 3",
        "region": "Вологодская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.55 +k=1 +x_0=3250000 +y_0=-6214743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK35z4",
        "name": "МСК-35, Зона 4",
        "region": "Вологодская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.55 +k=1 +x_0=4250000 +y_0=-6214743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK36z1",
        "name": "МСК-36, Зона 1",
        "region": "Воронежская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=1250000 +y_0=-5212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK36z2",
        "name": "МСК-36, Зона 2",
        "region": "Воронежская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.48333333333 +k=1 +x_0=2250000 +y_0=-5212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK37z1",
        "name": "МСК-37, Зона 1",
        "region": "Ивановская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.55 +k=1 +x_0=1250000 +y_0=-6014743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK37z2",
        "name": "МСК-37, Зона 2",
        "region": "Ивановская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.55 +k=1 +x_0=2250000 +y_0=-6014743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK38z1",
        "name": "МСК-38, Зона 1",
        "region": "Иркутская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=97.03333333333 +k=1 +x_0=1250000 +y_0=-5411057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK38z2",
        "name": "МСК-38, Зона 2",
        "region": "Иркутская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=100.03333333333 +k=1 +x_0=2250000 +y_0=-5411057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK38z3",
        "name": "МСК-38, Зона 3",
        "region": "Иркутская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=103.03333333333 +k=1 +x_0=3250000 +y_0=-5411057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK38z4",
        "name": "МСК-38, Зона 4",
        "region": "Иркутская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=106.03333333333 +k=1 +x_0=4250000 +y_0=-5411057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK38z5",
        "name": "МСК-38, Зона 5",
        "region": "Иркутская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=109.03333333333 +k=1 +x_0=5250000 +y_0=-5411057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK38z6",
        "name": "МСК-38, Зона 6",
        "region": "Иркутская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=112.03333333333 +k=1 +x_0=6250000 +y_0=-5411057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK38z7",
        "name": "МСК-38, Зона 7",
        "region": "Иркутская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=115.03333333333 +k=1 +x_0=7250000 +y_0=-5411057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK38z8",
        "name": "МСК-38, Зона 8",
        "region": "Иркутская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=118.03333333333 +k=1 +x_0=8250000 +y_0=-5411057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK39",
        "name": "МСК-39",
        "region": "Калининградская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=21.45 +k=1 +x_0=1250000 +y_0=-5711057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK40",
        "name": "МСК-40",
        "region": "Калужская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=1250000 +y_0=-5612900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK41d6z1",
        "name": "МСК-41 (6°), Зона 1",
        "region": "Камчатский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=158.46666666667 +k=1 +x_0=1400000 +y_0=-5316586.442 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK41d6z2",
        "name": "МСК-41 (6°), Зона 2",
        "region": "Камчатский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=164.46666666667 +k=1 +x_0=2400000 +y_0=-5316586.442 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK41d6z3",
        "name": "МСК-41 (6°), Зона 3",
        "region": "Камчатский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=170.46666666667 +k=1 +x_0=3400000 +y_0=-5316586.442 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK42z1",
        "name": "МСК-42, Зона 1",
        "region": "Кемеровская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=85.46666666666 +k=1 +x_0=1300000 +y_0=-5512900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK42z2",
        "name": "МСК-42, Зона 2",
        "region": "Кемеровская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=88.46666666666 +k=1 +x_0=2300000 +y_0=-5512900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK43z1",
        "name": "МСК-43, Зона 1",
        "region": "Кировская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=47.55 +k=1 +x_0=1250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK43z2",
        "name": "МСК-43, Зона 2",
        "region": "Кировская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=50.55 +k=1 +x_0=2250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK43z3",
        "name": "МСК-43, Зона 3",
        "region": "Кировская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=53.55 +k=1 +x_0=3250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK44z1",
        "name": "МСК-44, Зона 1",
        "region": "Костромская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.55 +k=1 +x_0=1250000 +y_0=-6114743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK44z2",
        "name": "МСК-44, Зона 2",
        "region": "Костромская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.55 +k=1 +x_0=2250000 +y_0=-6114743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK44z3",
        "name": "МСК-44, Зона 3",
        "region": "Костромская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=47.55 +k=1 +x_0=3250000 +y_0=-6114743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK45z1",
        "name": "МСК-45, Зона 1",
        "region": "Курганская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=61.03333333333 +k=1 +x_0=1300000 +y_0=-5709414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK45z2",
        "name": "МСК-45, Зона 2",
        "region": "Курганская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=64.03333333333 +k=1 +x_0=2300000 +y_0=-5709414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK45z3",
        "name": "МСК-45, Зона 3",
        "region": "Курганская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=67.03333333333 +k=1 +x_0=3300000 +y_0=-5709414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK46z1",
        "name": "МСК-46, Зона 1",
        "region": "Курская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=1250000 +y_0=-5312900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK46z2",
        "name": "МСК-46, Зона 2",
        "region": "Курская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=2250000 +y_0=-5312900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK47z1",
        "name": "МСК-47, Зона 1",
        "region": "Ленинградская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=27.95 +k=1 +x_0=1250000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK47z2",
        "name": "МСК-47, Зона 2",
        "region": "Ленинградская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=30.95 +k=1 +x_0=2250000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK47z3",
        "name": "МСК-47, Зона 3",
        "region": "Ленинградская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=33.95 +k=1 +x_0=3250000 +y_0=-6211057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK1964sp",
        "name": "МСК-1964 Санкт-Петербург",
        "region": "г. Санкт-Петербург",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=30 +k=1 +x_0=95942.17 +y_0=-6552810.0 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK48z1",
        "name": "МСК-48, Зона 1",
        "region": "Липецкая область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=1250000 +y_0=-5412900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK48z2",
        "name": "МСК-48, Зона 2",
        "region": "Липецкая область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.48333333333 +k=1 +x_0=2250000 +y_0=-5412900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK49d6z1",
        "name": "МСК-49 (6°), Зона 1",
        "region": "Магаданская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=144.45 +k=1 +x_0=1400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK49d6z2",
        "name": "МСК-49 (6°), Зона 2",
        "region": "Магаданская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=150.45 +k=1 +x_0=2400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK49d6z3",
        "name": "МСК-49 (6°), Зона 3",
        "region": "Магаданская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=156.45 +k=1 +x_0=3400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK49d6z4",
        "name": "МСК-49 (6°), Зона 4",
        "region": "Магаданская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=162.45 +k=1 +x_0=4400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSKMGGT",
        "name": "Московская СК (МГГТ)",
        "region": "г. Москва",
        "proj": "+proj=tmerc +lat_0=55.66666666667 +lon_0=37.5 +k=1 +x_0=16.098 +y_0=14.512 +ellps=bessel +towgs84=316.151,78.924,589.650,-1.57273,2.69209,2.34693,8.4507 +units=m +no_defs "
    },
    {
        "id": "MSK50z1",
        "name": "МСК-50, Зона 1",
        "region": "Московская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=1250000 +y_0=-5712900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK50z2",
        "name": "МСК-50, Зона 2",
        "region": "Московская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=2250000 +y_0=-5712900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK51d6z1",
        "name": "МСК-51 (6°), Зона 1",
        "region": "Мурманская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=32.03333333333 +k=1 +x_0=1400000 +y_0=-7011057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK51d6z2",
        "name": "МСК-51 (6°), Зона 2",
        "region": "Мурманская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.03333333333 +k=1 +x_0=2400000 +y_0=-7011057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK52z1",
        "name": "МСК-52, Зона 1",
        "region": "Нижегородская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.55 +k=1 +x_0=1250000 +y_0=-5714743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK52z2",
        "name": "МСК-52, Зона 2",
        "region": "Нижегородская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.55 +k=1 +x_0=2250000 +y_0=-5714743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK52z3",
        "name": "МСК-52, Зона 3",
        "region": "Нижегородская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=47.55 +k=1 +x_0=3250000 +y_0=-5714743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK53z1",
        "name": "МСК-53, Зона 1",
        "region": "Новгородская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=29.48333333333 +k=1 +x_0=1250000 +y_0=-5912900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK53z2",
        "name": "МСК-53, Зона 2",
        "region": "Новгородская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=32.48333333333 +k=1 +x_0=2250000 +y_0=-5912900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK53z3",
        "name": "МСК-53, Зона 3",
        "region": "Новгородская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=3250000 +y_0=-5912900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK54z1",
        "name": "МСК-54, Зона 1",
        "region": "Новосибирская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=74.73333333333 +k=1 +x_0=1250000 +y_0=-5612900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK54z2",
        "name": "МСК-54, Зона 2",
        "region": "Новосибирская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=77.73333333333 +k=1 +x_0=2250000 +y_0=-5612900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK54z3",
        "name": "МСК-54, Зона 3",
        "region": "Новосибирская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=80.73333333333 +k=1 +x_0=3250000 +y_0=-5612900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK54z4",
        "name": "МСК-54, Зона 4",
        "region": "Новосибирская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=83.73333333333 +k=1 +x_0=4250000 +y_0=-5612900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK55z1",
        "name": "МСК-55, Зона 1",
        "region": "Омская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=71.73333333333 +k=1 +x_0=1250000 +y_0=-5612900.563 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK55z2",
        "name": "МСК-55, Зона 2",
        "region": "Омская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=74.73333333333 +k=1 +x_0=2250000 +y_0=-5612900.563 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK56z1",
        "name": "МСК-56, Зона 1",
        "region": "Оренбургская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=52.03333333333 +k=1 +x_0=1300000 +y_0=-5309414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK56z2",
        "name": "МСК-56, Зона 2",
        "region": "Оренбургская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=55.03333333333 +k=1 +x_0=2300000 +y_0=-5309414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK56z3",
        "name": "МСК-56, Зона 3",
        "region": "Оренбургская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=58.03333333333 +k=1 +x_0=3300000 +y_0=-5309414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK56z4",
        "name": "МСК-56, Зона 4",
        "region": "Оренбургская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=61.03333333333 +k=1 +x_0=4300000 +y_0=-5309414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK57z1",
        "name": "МСК-57, Зона 1",
        "region": "Орловская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=32.48333333333 +k=1 +x_0=1250000 +y_0=-12900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK57z2",
        "name": "МСК-57, Зона 2",
        "region": "Орловская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=2250000 +y_0=-12900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK57z3",
        "name": "МСК-57, Зона 3",
        "region": "Орловская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=3250000 +y_0=-12900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK58z1",
        "name": "МСК-58, Зона 1",
        "region": "Пензенская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.05 +k=1 +x_0=1300000 +y_0=-5514743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK58z2",
        "name": "МСК-58, Зона 2",
        "region": "Пензенская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=46.05 +k=1 +x_0=2300000 +y_0=-5514743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK59z1",
        "name": "МСК-59, Зона 1",
        "region": "Пермский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=53.55 +k=1 +x_0=1250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK59z2",
        "name": "МСК-59, Зона 2",
        "region": "Пермский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=56.55 +k=1 +x_0=2250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK59z3",
        "name": "МСК-59, Зона 3",
        "region": "Пермский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=59.55 +k=1 +x_0=3250000 +y_0=-5914743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK60z1",
        "name": "МСК-60, Зона 1",
        "region": "Псковская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=27.95 +k=1 +x_0=1250000 +y_0=-5911057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK60z2",
        "name": "МСК-60, Зона 2",
        "region": "Псковская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=30.95 +k=1 +x_0=2250000 +y_0=-5911057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK60z3",
        "name": "МСК-60, Зона 3",
        "region": "Псковская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=33.95 +k=1 +x_0=3250000 +y_0=-5911057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK61z1",
        "name": "МСК-61, Зона 1",
        "region": "Ростовская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=37.98333333333 +k=1 +x_0=1300000 +y_0=-4811057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK61z2",
        "name": "МСК-61, Зона 2",
        "region": "Ростовская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=40.98333333333 +k=1 +x_0=2300000 +y_0=-4811057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK61z3",
        "name": "МСК-61, Зона 3",
        "region": "Ростовская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.98333333333 +k=1 +x_0=3300000 +y_0=-4811057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK62z1",
        "name": "МСК-62, Зона 1",
        "region": "Рязанская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=1250000 +y_0=-5612900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK62z2",
        "name": "МСК-62, Зона 2",
        "region": "Рязанская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.48333333333 +k=1 +x_0=2250000 +y_0=-5612900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK62z3",
        "name": "МСК-62, Зона 3",
        "region": "Рязанская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.48333333333 +k=1 +x_0=3250000 +y_0=-5612900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK63z1",
        "name": "МСК-63, Зона 1",
        "region": "Самарская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=49.03333333333 +k=1 +x_0=1300000 +y_0=-5509414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK63z2",
        "name": "МСК-63, Зона 2",
        "region": "Самарская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=52.03333333333 +k=1 +x_0=2300000 +y_0=-5509414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK64z1",
        "name": "МСК-64, Зона 1",
        "region": "Саратовская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=43.05 +k=1 +x_0=1300000 +y_0=-5214743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK64z2",
        "name": "МСК-64, Зона 2",
        "region": "Саратовская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=46.05 +k=1 +x_0=2300000 +y_0=-5214743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK64z3",
        "name": "МСК-64, Зона 3",
        "region": "Саратовская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=49.05 +k=1 +x_0=3300000 +y_0=-5214743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK65",
        "name": "МСК-65",
        "region": "Сахалинская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=142.71666666667 +k=1 +x_0=1300000 +y_0=-4516586.439 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK66d3z1",
        "name": "МСК-66 (3°), Зона 1",
        "region": "Свердловская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=60.05 +k=1 +x_0=1500000 +y_0=-5911057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK66d3z2",
        "name": "МСК-66 (3°), Зона 2",
        "region": "Свердловская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=63.05 +k=1 +x_0=2500000 +y_0=-5911057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK66d3z3",
        "name": "МСК-66 (3°), Зона 3",
        "region": "Свердловская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=66.05 +k=1 +x_0=3500000 +y_0=-5911057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK66d6z1",
        "name": "МСК-66 (6°), Зона 1",
        "region": "Свердловская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=60.05 +k=1 +x_0=1500000 +y_0=-5911057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK66d6z2",
        "name": "МСК-66 (6°), Зона 2",
        "region": "Свердловская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=66.05 +k=1 +x_0=2500000 +y_0=-5911057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK67z1",
        "name": "МСК-67, Зона 1",
        "region": "Смоленская область ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=32.48333333333 +k=1 +x_0=1250000 +y_0=-5612900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK67z2",
        "name": "МСК-67, Зона 2",
        "region": "Смоленская область ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=2250000 +y_0=-5612900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK67z3",
        "name": "МСК-67, Зона 3",
        "region": "Смоленская область ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=3250000 +y_0=-5612900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK68z1",
        "name": "МСК-68, Зона 1",
        "region": "Тамбовская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.48333333333 +k=1 +x_0=1250000 +y_0=-5412900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK68z2",
        "name": "МСК-68, Зона 2",
        "region": "Тамбовская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.48333333333 +k=1 +x_0=2250000 +y_0=-5412900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK68z3",
        "name": "МСК-68, Зона 3",
        "region": "Тамбовская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=47.48333333333 +k=1 +x_0=3250000 +y_0=-5412900.56 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK69z1",
        "name": "МСК-69, Зона 1",
        "region": "Тверская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=32.48333333333 +k=1 +x_0=1250000 +y_0=-6012900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK69z2",
        "name": "МСК-69, Зона 2",
        "region": "Тверская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=2250000 +y_0=-6012900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK69z3",
        "name": "МСК-69, Зона 3",
        "region": "Тверская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=3250000 +y_0=-6012900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK70z1",
        "name": "МСК-70, Зона 1",
        "region": "Томская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=74.73333333333 +k=1 +x_0=1250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK70z2",
        "name": "МСК-70, Зона 2",
        "region": "Томская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=77.73333333333 +k=1 +x_0=2250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK70z3",
        "name": "МСК-70, Зона 3",
        "region": "Томская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=80.73333333333 +k=1 +x_0=3250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK70z4",
        "name": "МСК-70, Зона 4",
        "region": "Томская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=83.73333333333 +k=1 +x_0=4250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK70z5",
        "name": "МСК-70, Зона 5",
        "region": "Томская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=86.73333333333 +k=1 +x_0=5250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK70z6",
        "name": "МСК-70, Зона 6",
        "region": "Томская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=89.73333333333 +k=1 +x_0=6250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK71z1",
        "name": "МСК-71, Зона 1",
        "region": "Тульская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=35.48333333333 +k=1 +x_0=1250000 +y_0=-5612900.563 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK71z2",
        "name": "МСК-71, Зона 2",
        "region": "Тульская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.48333333333 +k=1 +x_0=2250000 +y_0=-5612900.563 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK71s95",
        "name": "МСК-71.1 (На базе СК-95)",
        "region": "Тульская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=37.427222222222 +k=1 +x_0=250000 +y_0=-5263444.764 +ellps=krass +towgs84=24.83, -130.97, -81.74, 0, 0, -0.13, -0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d15z1",
        "name": "МСК-72 (1.5°), Зона 1",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=66.08333333 +k=1 +x_0=1500000 +y_0=-6000000 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d15z2",
        "name": "МСК-72 (1.5°), Зона 2",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=67.58333333 +k=1 +x_0=2500000 +y_0=-6000000 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d15z3",
        "name": "МСК-72 (1.5°), Зона 3",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=69.08333333 +k=1 +x_0=3500000 +y_0=-6000000 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d15z4",
        "name": "МСК-72 (1.5°), Зона 4",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=70.58333333 +k=1 +x_0=4500000 +y_0=-6000000 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d15z5",
        "name": "МСК-72 (1.5°), Зона 5",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=72.08333333 +k=1 +x_0=5500000 +y_0=-6000000 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d15z6",
        "name": "МСК-72 (1.5°), Зона 6",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=73.58333333 +k=1 +x_0=6500000 +y_0=-6000000 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d3z1",
        "name": "МСК-72 (3°), Зона 1",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=63.05 +k=1 +x_0=1500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d3z2",
        "name": "МСК-72 (3°), Зона 2",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=66.05 +k=1 +x_0=2500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d3z3",
        "name": "МСК-72 (3°), Зона 3",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=69.05 +k=1 +x_0=3500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d3z4",
        "name": "МСК-72 (3°), Зона 4",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=72.05 +k=1 +x_0=4500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d3z5",
        "name": "МСК-72 (3°), Зона 5",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=75.05 +k=1 +x_0=5500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d6z1",
        "name": "МСК-72 (6°), Зона 1",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=63.05 +k=1 +x_0=1500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d6z2",
        "name": "МСК-72 (6°), Зона 2",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=69.05 +k=1 +x_0=2500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK72d6z3",
        "name": "МСК-72 (6°), Зона 3",
        "region": "Тюменская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=75.05 +k=1 +x_0=3500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK73z1",
        "name": "МСК-73, Зона 1",
        "region": "Ульяновская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=46.05 +k=1 +x_0=1300000 +y_0=-5514743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK73z2",
        "name": "МСК-73, Зона 2",
        "region": "Ульяновская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=49.05 +k=1 +x_0=2300000 +y_0=-5514743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK74z1",
        "name": "МСК-74, Зона 1",
        "region": "Челябинская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=58.03333333333 +k=1 +x_0=1300000 +y_0=-5509414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK74z2",
        "name": "МСК-74, Зона 2",
        "region": "Челябинская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=61.03333333333 +k=1 +x_0=2300000 +y_0=-5509414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK74z3",
        "name": "МСК-74, Зона 3",
        "region": "Челябинская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=64.03333333333 +k=1 +x_0=3300000 +y_0=-5509414.70 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK75z1",
        "name": "МСК-75, Зона 1",
        "region": "Забайкальский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=109.03333333333 +k=1 +x_0=1250000 +y_0=-5111057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK75z2",
        "name": "МСК-75, Зона 2",
        "region": "Забайкальский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=112.03333333333 +k=1 +x_0=2250000 +y_0=-5111057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK75z3",
        "name": "МСК-75, Зона 3",
        "region": "Забайкальский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=115.03333333333 +k=1 +x_0=3250000 +y_0=-5111057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK75z4",
        "name": "МСК-75, Зона 4",
        "region": "Забайкальский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=118.03333333333 +k=1 +x_0=4250000 +y_0=-5111057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK75z5",
        "name": "МСК-75, Зона 5",
        "region": "Забайкальский край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=121.03333333333 +k=1 +x_0=5250000 +y_0=-5111057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK76z1",
        "name": "МСК-76, Зона 1",
        "region": "Ярославская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=38.55 +k=1 +x_0=1250000 +y_0=-6014743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK76z2",
        "name": "МСК-76, Зона 2",
        "region": "Ярославская область",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=41.55 +k=1 +x_0=2250000 +y_0=-6014743.504 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK83d6z3",
        "name": "МСК-83 (6°), Зона 3",
        "region": "Ненецкий автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=44.03333333333 +k=1 +x_0=3400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK83d6z4",
        "name": "МСК-83 (6°), Зона 4",
        "region": "Ненецкий автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=50.03333333333 +k=1 +x_0=4400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK83d6z5",
        "name": "МСК-83 (6°), Зона 5",
        "region": "Ненецкий автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=56.03333333333 +k=1 +x_0=5400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK83d6z6",
        "name": "МСК-83 (6°), Зона 6",
        "region": "Ненецкий автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=62.03333333333 +k=1 +x_0=6400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK83d6z7",
        "name": "МСК-83 (6°), Зона 7",
        "region": "Ненецкий автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=68.03333333333 +k=1 +x_0=7400000 +y_0=-6511057.628 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK86d6z1",
        "name": "МСК-86 (6°), Зона 1",
        "region": "Ханты-Мансийский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=60.05 +k=1 +x_0=1500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK86d6z2",
        "name": "МСК-86 (6°), Зона 2",
        "region": "Ханты-Мансийский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=66.05 +k=1 +x_0=2500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK86d6z3",
        "name": "МСК-86 (6°), Зона 3",
        "region": "Ханты-Мансийский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=72.05 +k=1 +x_0=3500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK86d6z4",
        "name": "МСК-86 (6°), Зона 4",
        "region": "Ханты-Мансийский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=78.05 +k=1 +x_0=4500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK86d6z5",
        "name": "МСК-86 (6°), Зона 5",
        "region": "Ханты-Мансийский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=84.05 +k=1 +x_0=5500000 +y_0=-5811057.63 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK87d6z3",
        "name": "МСК-87 (6°), Зона 3",
        "region": "Чукотский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=156.45 +k=1 +x_0=3400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK87d6z4",
        "name": "МСК-87 (6°), Зона 4",
        "region": "Чукотский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=162.45 +k=1 +x_0=4400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK87d6z5",
        "name": "МСК-87 (6°), Зона 5",
        "region": "Чукотский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=168.45 +k=1 +x_0=5400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK87d6z6",
        "name": "МСК-87 (6°), Зона 6",
        "region": "Чукотский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=174.45 +k=1 +x_0=6400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK87d6z7",
        "name": "МСК-87 (6°), Зона 7",
        "region": "Чукотский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=180.45 +k=1 +x_0=7400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSK87d6z8",
        "name": "МСК-87 (6°), Зона 8",
        "region": "Чукотский автономный округ",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=186.45 +k=1 +x_0=8400000 +y_0=-6212900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs"
    },
    {
        "id": "MSKKRASN",
        "name": "МСК г. Красноярска",
        "region": "г. Красноярск",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=93 +k=1 +x_0=54304.47 +y_0=-6196680.59 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs "
    },
    {
        "id": "MSK163",
        "name": "МСК-163",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=81 +k=1 +x_0=65425.7 +y_0=-7434483.2 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs "
    },
    {
        "id": "MSK164",
        "name": "МСК-164",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=84 +k=1 +x_0=86209.8 +y_0=-6542783.5 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs "
    },
    {
        "id": "MSK165",
        "name": "МСК-165",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=87 +k=1 +x_0=105295.8 +y_0=-5652185. +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs "
    },
    {
        "id": "MSK166",
        "name": "МСК-166",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=90 +k=1 +x_0=107543.3 +y_0=-5540944.5 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs "
    },
    {
        "id": "MSK167",
        "name": "МСК-167",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=93 +k=1 +x_0=106797.8 +y_0=-5578022.5 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs "
    },
    {
        "id": "MSK168",
        "name": "МСК-168",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=96 +k=1 +x_0=108285.2 +y_0=-5503868.6 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs "
    },
    {
        "id": "MSK169",
        "name": "МСК-169",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=99 +k=1 +x_0=117308.6 +y_0=-5503868.6 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs "
    },
    {
        "id": "MSK170",
        "name": "МСК-170",
        "region": "Красноярский Край",
        "proj": "+proj=tmerc +lat_0=0 +lon_0=102 +k=1 +x_0=90338.90 +y_0=-6357146.10 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs "
    }
]

/**
 * Получение объекта МСК по ID
 * @param id ID МСК
 * @returns Объект МСК
 */
export const get = (id: string): MskRecord => {
    return msk.filter(i => i.id.toLowerCase() == id.toLowerCase())[0]
}